src/app/app/controllers/administrators_controller.rb

    def setting_manager
        @college = College.find(params[:college])
        if !(user_found?)
            flash[:notice] = "Nenhum usuário encontrado com esse nome"
        else
            if (user_is_already_administrator?)
                flash[:notice] = "Usuário já é administrador"
            else
                @user = User.find_by(nickname: params[:user][:nickname])
                @college.administrator.create(user_id: @user.id)
---
SELECT  "colleges".* FROM "colleges" WHERE "colleges"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."nickname" = $1 LIMIT $2  [["nickname", "higormoles"], ["LIMIT", 1]]
INSERT INTO "administrators" ("user_id", "college_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["college_id", 1], ["created_at", "2019-11-01 12:09:19.748170"], ["updated_at", "2019-11-01 12:09:19.748170"]]

    def user_found?
        User.where(nickname: params[:user][:nickname]).exists?
---
SELECT  1 AS one FROM "users" WHERE "users"."nickname" = $1 LIMIT $2  [["nickname", "higormoles"], ["LIMIT", 1]]

    def user_is_already_administrator?
        @user = User.find_by(nickname: params[:user][:nickname])
        Administrator.where(user_id: @user.id, college_id: @college.id).exists?
---
SELECT  "users".* FROM "users" WHERE "users"."nickname" = $1 LIMIT $2  [["nickname", "higormoles"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE (higormoles) LIMIT $1  [["LIMIT", 1]]
SELECT  1 AS one FROM "administrators" WHERE "administrators"."user_id" = $1 AND "administrators"."college_id" = $2 LIMIT $3  [["user_id", 1], ["college_id", 1], ["LIMIT", 1]]