src/app/app/controllers/application_controller.rb

SELECT  1 AS one FROM "colleges" WHERE "colleges"."user_id" = $1 AND "colleges"."id" = $2 LIMIT $3  [["user_id", 2], ["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "favorite_colleges" WHERE "favorite_colleges"."user_id" = $1 AND "favorite_colleges"."college_id" = $2 LIMIT $3  [["user_id", 1], ["college_id", 1], ["LIMIT", 1]]
---
    def already_favorited(college_id)
        FavoriteCollege.exists?(user_id: current_user.id, college_id: college_id)

SELECT  1 AS one FROM "favorite_spotteds" WHERE "favorite_spotteds"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
    def already_favorited_any_spotted
        FavoriteSpotted.exists?(user_id: current_user.id)

SELECT  1 AS one FROM "colleges" WHERE "colleges"."user_id" = $1 AND "colleges"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "administrators" WHERE "administrators"."user_id" = $1 AND "administrators"."college_id" = $2 LIMIT $3  [["user_id", 2], ["college_id", 1], ["LIMIT", 1]]
---
    def isPageAdmin(college_id)
        if College.exists?(user_id: current_user.id, id: college_id)
            return true

        elsif Administrator.exists?(user_id: current_user.id, college_id: college_id)

SELECT  1 AS one FROM "colleges" WHERE "colleges"."user_id" = $1 AND "colleges"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "administrators" WHERE "administrators"."user_id" = $1 AND "administrators"."college_id" = $2 LIMIT $3  [["user_id", 2], ["college_id", 1], ["LIMIT", 1]]
---
    def isUserAdminOfPage(college_id, user_id)
        if College.exists?(user_id: user_id, id: college_id)
            return true

        elsif Administrator.exists?(user_id: user_id, college_id: college_id)