src/app/app/controllers/college_whitelists_controller.rb

SELECT  "college_whitelists".* FROM "college_whitelists" WHERE "college_whitelists"."user_id" = $1 AND "college_whitelists"."college_id" = $2 LIMIT $3  [["user_id", 2], ["college_id", 1], ["LIMIT", 1]]
---
    def verifica_caminho
        if college_dont_need_permission
          redirect_to college_spotteds_path(college_id: @college.id)
        else
          @college_whitelist = CollegeWhitelist.find_by(user_id: current_user.id, college_id: @college.id)

SELECT "college_whitelists".* FROM "college_whitelists"
---
    def index
        if isPageAdmin(params[:college_id])
            @college_whitelists = CollegeWhitelist.all

INSERT INTO "college_whitelists" ("status", "created_at", "updated_at", "user_id", "college_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["status", 0], ["created_at", "2019-11-06 03:14:31.547206"], ["updated_at", "2019-11-06 03:14:31.547206"], ["user_id", 2], ["college_id", 1]]
---
    def create
        @college_whitelist = CollegeWhitelist.new(college_whitelist_params)

        respond_to do |format|
            if @college_whitelist.save

UPDATE "college_whitelists" SET "status" = $1, "updated_at" = $2 WHERE "college_whitelists"."id" = $3  [["status", 1], ["updated_at", "2019-12-04 14:40:28.680502"], ["id", 3]]
---
    def update
        respond_to do |format|
        if @college_whitelist.update(college_whitelist_params)

SELECT  "colleges".* FROM "colleges" WHERE "colleges"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        def set_college
            @college = College.find(params[:college_id])