src/app/app/controllers/college_whitelists_controller.rb

        def set_college
            @college = College.find(params[:college_id])
---
SELECT  "colleges".* FROM "colleges" WHERE "colleges"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]