src/app/app/controllers/college_whitelists_controller.rb

    def index
        if isPageAdmin(params[:college_id])
            @college_whitelists = CollegeWhitelist.where(college_id: params[:college_id])
---
SELECT "college_whitelists".* FROM "college_whitelists" WHERE "college_whitelists"."college_id" = $1  [["college_id", 1]]

    def create
        @college_whitelist = CollegeWhitelist.new(college_whitelist_params)
        @college_whitelist.user = current_user
        @college_whitelist.college = @college

        respond_to do |format|
            if @college_whitelist.save
---
INSERT INTO "college_whitelists" ("status", "created_at", "updated_at", "user_id", "college_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["status", 0], ["created_at", "2019-11-12 16:03:11.423993"], ["updated_at", "2019-11-12 16:03:11.423993"], ["user_id", 1], ["college_id", 1]]

    def revoke
        @college_whitelist = CollegeWhitelist.find(params[:college_whitelist_id])
        respond_to do |format|
            if @college_whitelist.update(status: :pending)
---
SELECT  "college_whitelists".* FROM "college_whitelists" WHERE "college_whitelists"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "college_whitelists" SET "status" = $1, "updated_at" = $2 WHERE "college_whitelists"."id" = $3  [["status", 0], ["updated_at", "2019-12-04 14:41:14.969149"], ["id", 3]]

    def aprove
        @college_whitelist = CollegeWhitelist.find(params[:college_whitelist_id])
        respond_to do |format|
            if @college_whitelist.update(status: :approved)
---
SELECT  "college_whitelists".* FROM "college_whitelists" WHERE "college_whitelists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "college_whitelists" SET "status" = $1, "updated_at" = $2 WHERE "college_whitelists"."id" = $3  [["status", 0], ["updated_at", "2019-11-14 13:21:58.266720"], ["id", 2]]

    def reject
        @college_whitelist = CollegeWhitelist.find(params[:college_whitelist_id])
        respond_to do |format|
            if @college_whitelist.update(status: :rejected)
---
SELECT  "college_whitelists".* FROM "college_whitelists" WHERE "college_whitelists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "college_whitelists" SET "status" = $1, "updated_at" = $2 WHERE "college_whitelists"."id" = $3  [["status", 1], ["updated_at", "2019-11-14 13:16:07.799102"], ["id", 2]]

        def set_college_whitelist
            @college_whitelist = CollegeWhitelist.find(params[:id])
---
SELECT  "college_whitelists".* FROM "college_whitelists" WHERE "college_whitelists"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

        def set_college
            @college = College.find(params[:college_id])
---
SELECT  "colleges".* FROM "colleges" WHERE "colleges"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]