src/app/app/controllers/colleges_controller.rb

SELECT  "colleges".* FROM "colleges" WHERE "colleges"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @college = College.find(params[:id])

SELECT "colleges".* FROM "colleges"
---
    def index
        @colleges = College.all

INSERT INTO "colleges" ("name", "initials", "city", "state", "country", "unit", "created_at", "updated_at", "user_id", "background_color", "font_family", "background_image", "font_color", "request_to_participate", "admin_approves_spotted") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15) RETURNING "id"
INSERT INTO "college_whitelists" ("status", "created_at", "updated_at", "user_id", "college_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["status", 1], ["created_at", "2019-11-21 01:50:00.758582"], ["updated_at", "2019-11-21 01:50:00.758582"], ["user_id", 1], ["college_id", 1]]
---
    def create
        @college = College.new(college_params)
        @college.user = current_user
        if @college.save
            current_user.favorites << @college
            @cw = CollegeWhitelist.new(college: @college, user: current_user, status: "approved")
            if @cw.save

SELECT  "colleges".* FROM "colleges" WHERE "colleges"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def favorite
        @college = College.find(params[:id])

SELECT  "colleges".* FROM "colleges" WHERE "colleges"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def destroy
        @college = College.find(params[:id])

SELECT  "colleges".* FROM "colleges" WHERE "colleges"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        def set_college
            @college = College.find(params[:id])