src/app/app/controllers/favorite_colleges_controller.rb

    def show
        @favorite_colleges = FavoriteCollege.where(user_id: current_user.id)
---
SELECT "favorite_colleges".* FROM "favorite_colleges" WHERE "favorite_colleges"."user_id" = $1  [["user_id", 1]]