src/app/app/controllers/navegation_controller.rb

SELECT "colleges".* FROM "colleges"
---
    def show
        @colleges = College.all