src/app/app/controllers/sessions_controller.rb

  def create
    user= User.find_by(email: params[:session][:email].downcase)
    user_nick= User.find_by(nickname: params[:session][:email].downcase)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "lucaschabariberi@usp.br"], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."nickname" = $1 LIMIT $2  [["nickname", "higor_moles@hotmail.com"], ["LIMIT", 1]]