src/app/app/controllers/spotteds_controller.rb

SELECT "spotteds".* FROM "spotteds" WHERE "spotteds"."college_id" = $1  [["college_id", 1]]
---
    def index
        @spotteds = @college.spotteds
        @college_style = ''

        if @college.background_image.present?

SELECT  "spotteds".* FROM "spotteds" WHERE "spotteds"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def show
        @spotted = Spotted.find(params[:id])

SELECT  "colleges".* FROM "colleges" WHERE "colleges"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def create
        @spotted = Spotted.new(spotted_params)
        @spotted.user = current_user
        @spotted.college = College.find(params[:college_id])

SELECT  "colleges".* FROM "colleges" WHERE "colleges"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
        def set_college
            @college = College.find(params[:college_id])