src/app/app/controllers/users_controller.rb

    def create
        @user = User.new(user_params)

        if (user_params[:profile_picture])
            img_file = user_params[:profile_picture].tempfile.open.read.force_encoding(Encoding::UTF_8)
            img_file_type = user_params[:profile_picture].content_type
            @user.profile_picture = Base64.encode64(img_file)
            @user.profile_picture_content_type = img_file_type
        end

        if @user.save
---
INSERT INTO "users" ("email", "first_name", "last_name", "password_digest", "birth_date", "created_at", "updated_at", "city", "state", "country", "nickname") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

    def change_menu_preference
        type = params[:type]
        if type == "circle"
            current_user.update_column(:menu_preference, "circle")
            redirect_back fallback_location: root_url

        elsif type == "list"
            current_user.update_column(:menu_preference, "list")
---
UPDATE "users" SET "menu_preference" = $1 WHERE "users"."id" = $2  [["menu_preference", "circle"], ["id", 1]]
UPDATE "users" SET "menu_preference" = $1 WHERE "users"."id" = $2  [["menu_preference", "list"], ["id", 1]]