src/app/app/views/spotteds/index.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
                </p>
                <% pre_like = spotted.like.find { |like| like.user_id == current_user.id} %>