src/app/app/views/favorite_colleges/show.html.erb

                  <td>País</td>
                  <td><%= fav.college.country %></td>
---
SELECT  "colleges".* FROM "colleges" WHERE "colleges"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]